[
    {
        "title": "San Francisco's History in Street Names",
        "text": "This is an extremely condensed history of San Francisco, focused on how various streets got their names. Each factoid is intentionally tweet-sized! You can tap or swipe to go forward and back, or using left and right keys on a desktop.",
        "location": {
            "place": "San Francisco",
            "center": {
                "lat": 37.765550,
                "lng": -122.447558
            },
            "zoom": 13
        }
    },
    {
        "title": "",
        "text": "This app was thrown together in five hours, and the content in even less time. It is not complete, comprehensive or even necessarily accurate. I'm not a real historian, I read history for the laughs.<br><br>I'm <a href=\"https://twitter.com/seldo\">@seldo</a> on Twitter and you can direct your cries of outrage there.",
        "location": {
            "place": "San Francisco",
            "center": {
                "lat": 37.765550,
                "lng": -122.447558
            },
            "zoom": 13
        }
    },
    {
        "title": "Disclaimer",
        "text": "This history is about streets, and therefore ignores the Ohlone, who were here for thousands of years before the Spanish showed up and began murdering them in the name of the church. There are no laughs to be had about that shit, and they did not build any streets to map.",
        "location": {
            "place": "Ohlone Way",
            "center": {
                "lat": 37.7365167,
                "lng": -122.4360941
            },
            "zoom": 18
        }
    },
    {
        "title": "Pegman!",
        "text": "You can drag the little yellow guy in the top left and get a street-level view of any of the places this app takes you. Try it now to see the TransAmerica building!",
        "location": {
            "place": "TransAmerica Pyramid",
            "center": {
                "lat": 37.7951775,
                "lng": -122.4049674
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "The very first things to be built in San Francisco were a military installation at Fort Point in the Presidio and the Mission San Francisco de Asís itself. This created a complicated chain of names.",
        "location": {
            "place": "Fort Point",
            "center": {
                "lat": 37.809920,
                "lng": -122.476334
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "Mission street is named after the Mission, but the mission isn't on that street. The current Mission is on Dolores street. Dolores Street is also named after the mission, because it was also called Mission Dolores.",
        "location": {
            "place": "Misión San Francisco de Asís",
            "center": {
                "lat": 37.764212,
                "lng": -122.426440
            },
            "zoom": 19
        }
    },
    {
        "title": "",
        "text": "The Mission Dolores name came from a creek (now almost entirely buried) that used to run near to the original mission. The creek was named after Nuestra Señora de los Dolores, Our Lady of Sorrows, after the patron saint of the day the creek was discovered by Spaniards.",
        "location": {
            "place": "Mission Creek, aka Dolores Creek",
            "center": {
                "lat": 37.773498,
                "lng": -122.394224
            },
            "zoom": 19
        }
    },
    {
        "title": "",
        "text": "But the original mission wasn't on Mission or Dolores! It was at Albion and Camp streets, two blocks away. There's a plaque. Albion Street is named after Nova Albion, which is what Francis Drake had called California when he sailed by in 1579 and failed to spot San Franciso bay.",
        "location": {
            "place": "Original Mission plaque",
            "center": {
                "lat": 37.764047,
                "lng": -122.422776 
            },
            "zoom": 19
        }
    },
    {
        "title": "",
        "text": "The first permanent habitation and oldest street location in San Francisco is 827-843 Grant Avenue (then called Calle de la Fundación), where William Richardson, a whaling captain, set up a trading business after marrying the daughter of the commander of the Presidio in 1835.",
        "location": {
            "place": "827 Grant Avenue",
            "center": {
                "lat": 37.794678, 
                "lng": -122.406392
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "I haven't found anything on Grant Avenue that indicates it's the oldest anything. San Francisco (called Yerba Buena at that time) remained small and quiet until 1846, when John Charles Frémont decided that California should be annexed by America from Mexico and invaded.",
        "location": {
            "place": "827 Grant Avenue",
            "center": {
                "lat": 37.794678, 
                "lng": -122.406392
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "Frémont had 60 guys with guns under his command, but he was not really part of the army, and so this wasn't America declaring war on Mexico, he was just... some guy being a dick. They kicked him out but he kept coming back and stirring up trouble.",
        "location": {
            "place": "Fremont Street",
            "center": {
                "lat": 37.789177,
                "lng": -122.395088
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "Frémont's father in law was Senator Thomas Hart Benton of Missouri, who also wanted to annex California. For this service to dickishness, Benton also gets a street. Frémont's shit-stirring eventually led to the Bear Flag Revolt.",
        "location": {
            "place": "Benton Avenue",
            "center": {
                "lat": 37.732850, 
                "lng": -122.425515
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "The Bear Flag revolt was basically a bunch of drunk dudes who declared a republic and made a flag and moved into the house of Mexican general Mariano Vallejo, then in charge, where they stayed, still drunk, for the next 3 weeks until Frémont showed up and took over from them.",
        "location": {
            "place": "Vallejo Street",
            "center": {
                "lat": 37.796752, 
                "lng": -122.422973
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "Of course, Frémont was still not part of the army, so this was awkward and eventually the US sent some troops from the Mexican-American war (which had started a month earlier) and officially took over California with a nominal force of 70 soliders and marines.",
        "location": {
            "place": "Statue of Hidalgo, last Mexican governor",
            "center": {
                "lat": 37.759725, 
                "lng": -122.427748
            },
            "zoom": 19
        }
    },
    {
        "title": "",
        "text": "In July 1848, 238 Mormons showed up in San Francisco, doubling its population. They had been fleeing persecution by the US government, so were very disappointed to discover that while en route their destination had become part of the USA, but they decided to stay anyway.",
        "location": {
            "place": "Mormon Church",
            "center": {
                "lat": 37.794631, 
                "lng": -122.426603
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "In this group was Sam Brannan, who quickly abandoned strict Mormon ways and became very rich selling mining supplies during the gold rush (of which more in a second). He also campaigned vociferously against changing Yerba Buena's name to San Francisco:",
        "location": {
            "place": "Brannan Street",
            "center": {
                "lat": 37.777318, 
                "lng": -122.397806
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "The guy who renamed Yerba Buena to San Franciso was Washington A Bartlett, the first American appointed alcalde (kind of like a mayor) of the town. He thought naming the town after the bay would be good for establishing it as the major town in the region, and he was right.",
        "location": {
            "place": "Bartlett Street",
            "center": {
                "lat": 37.752949, 
                "lng": -122.419648
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "The other reason he called it San Francisco was to prevent another town from taking that name. Thomas O. Larkin had been about to found a new town called Francisca, after General Vallejo's wife. ",
        "location": {
            "place": "Larkin Street",
            "center": {
                "lat": 37.791982, 
                "lng": -122.419293
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "After San Francisco took the name, Larkin used the general's wife's second name, Benicia, a town that still exists.",
        "location": {
            "place": "Benicia",
            "center": {
                "lat": 38.047753, 
                "lng": -122.157312
            },
            "zoom": 13
        }
    },
    {
        "title": "",
        "text": "Bartlett hired Jasper O'Farrell, an Irish engineer who'd previously lived in Philadelphia, to survey the town. He invented San Francisco's absurd \"Hills? What hills?\" grid system and named a street after himself.",
        "location": {
            "place": "O'Farrell Street",
            "center": {
                "lat": 37.784832, 
                "lng": -122.420724
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "O'Farrell also named Market Street after the one in Philadelphia (there was never a market on it), as well as Sansome and Filbert streets after streets in Philly.",
        "location": {
            "place": "Sansome Street",
            "center": {
                "lat": 37.797861, 
                "lng": -122.402112
            },
            "zoom": 13
        }
    },
    {
        "title": "",
        "text": "O'Farrell was not alone in naming streets after himself. In 1855 a local milkman Charles Gough, appointed to the committee to name streets in the expanding town, named Gough street after himself and Octavia street after his sister.",
        "location": {
            "place": "Octavia Street",
            "center": {
                "lat": 37.790168, 
                "lng": -122.427365
            },
            "zoom": 15
        }
    },
    {
        "title": "",
        "text": "But before that happened, the gold rush had to happen. John Sutter was trying to build a lumber mill near Coloma and hired a guy called James Marshall to do it.",
        "location": {
            "place": "James Marshall monument at Coloma",
            "center": {
                "lat": 38.796552, 
                "lng": -120.894145
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "Both Sutter and Marshall made nothing from the gold rush. Sutter had been granted the land by the Mexican government before the annexation but everybody just ignored that and claimed it for themselves.",
        "location": {
            "place": "Sutter Street",
            "center": {
                "lat": 37.787251, 
                "lng": -122.424196
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "The gold rush saw San Francisco explode in size from 459 people in 1847 to 30,000 in 1849 and 150,000 by 1870 and 342,000 by 1900. People made money mining gold but also in lots of nefarious ways.",
        "location": {
            "place": "Sutter Street",
            "center": {
                "lat": 37.787251, 
                "lng": -122.424196
            },
            "zoom": 13
        }
    },
    {
        "title": "",
        "text": "David Broderick literally made money by inventing a standardized gold currency for San Francisco (there wasn't enough paper money) and profited by selling $4 worth of gold as a $5 coin.",
        "location": {
            "place": "Broderick Street",
            "center": {
                "lat": 37.786491, 
                "lng": -122.441832
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "James Lick made his money by ignoring gold and buying land, spending less than $40,000 to buy lots in San Francisco in 1847 that then become worth millions by 1849. He never spent any of his money but gave it all away before he died, including founding an observatory.",
        "location": {
            "place": "US 101 is also called the James Lick Freeway",
            "center": {
                "lat": 37.705749, 
                "lng": -122.394252
            },
            "zoom": 14
        }
    },
    {
        "title": "",
        "text": "Joshua Norton, aka \"Emperor Norton\" also showed up in San Francisco around this time. Initially a rich trader, he became unhinged after losing all his money and declared himself emperor of San Francisco, and everybody played along, giving him free stuff until he died.",
        "location": {
            "place": "Emperor Norton Inn",
            "center": {
                "lat": 37.787844, 
                "lng": -122.412115
            },
            "zoom": 19
        }
    },
    {
        "title": "",
        "text": "In 1849 John W Geary was elected as San Francisco's last alcalde and its first mayor.",
        "location": {
            "place": "Geary Street (and also Boulevard)",
            "center": {
                "lat": 37.786852, 
                "lng": -122.412218
            },
            "zoom": 15
        }
    },
    {
        "title": "",
        "text": "In 1850 Lotta Crabtree was born in San Francisco. Playing in music halls in SF at first, she became America's highest paid actress. She donated her millions to charitable causes and also bequeathed a fountain of questionable taste to the city.",
        "location": {
            "place": "Lotta's Extremely Ugly Fountain",
            "center": {
                "lat": 37.787861, 
                "lng": -122.403321
            },
            "zoom": 19
        }
    },
    {
        "title": "",
        "text": "In 1851 gold rush money and explosive growth had turned SF into a lawless town. Sam Brannan showed up again, creating a Committee of Vigilance to find and summarily hang criminals. Members of the Vigilance Committee is the origin of the word \"vigilante\".",
        "location": {
            "place": "The site of \"Fort Gunnybags\", their HQ.",
            "center": {
                "lat": 37.794933, 
                "lng": -122.405032
            },
            "zoom": 18
        }
    },
    {
        "title": "",
        "text": "Also around this time Mark Twain lived in San Francisco. He never said \"The coldest winter I ever spent was summer in San Francisco\" but he should have, because that would have been neat and everyone thinks he did anyway.",
        "location": {
            "place": "Mark Twain Street",
            "center": {
                "lat": 37.795288,
                "lng": -122.401849
            },
            "zoom": 19
        }
    },
    {
        "title": "",
        "text": "By 1863 the gold rush was mostly over but William Chapman Ralston discovered that instead of gold there was an enormous amount of silver in the famous Comstock mine and made a fortune getting it out. ",
        "location": {
            "place": "Ralston Street",
            "center": {
                "lat": 37.717144, 
                "lng": -122.468927
            },
            "zoom": 17
        }
    },
    {
        "title": "",
        "text": "In the 1860s they tried to name a town after Ralston but he modestly refused, so instead they decided to name it after his modesty -- hence the town of Modesto, California. (Ralston Street in SF came much later)",
        "location": {
            "place": "Modesto, CA",
            "center": {
                "lat": 37.637105, 
                "lng": -120.996722
            },
            "zoom": 8
        }
    },    
    {
        "title": "",
        "text": "In 1865 Adolph Sutro arrived and told Ralston he could build a tunnel to help him get the silver out more cheaply and safely. The tunnel took forever to build and by the time it was done the silver was all mined out, but selling stock in the tunnel itself made Sutro very rich.",
        "location": {
            "place": "Sutro Tower was built in 1973 on land owned by his grandson",
            "center": {
                "lat": 37.755370, 
                "lng": -122.452134
            },
            "zoom": 17
        }
    },    
    {
        "title": "",
        "text": "William Ralston was also the force behind the creation of the Golden Gate Park, a totally artificial creation built on top of sand dunes by William Hammond Hall. It is 20% larger than New York's Central Park, a deliberate move to out-do New York.",
        "location": {
            "place": "Golden Gate Park",
            "center": {
                "lat": 37.769324, 
                "lng": -122.484099
            },
            "zoom": 14
        }
    },    
    {
        "title": "",
        "text": "Water was a real problem for Golden Gate Park, solved in 1902 by constructing windmills to power pumps, in case you've ever wondered why there are two random windmills in the park. They no longer pump water.",
        "location": {
            "place": "Golden Gate Park windmills",
            "center": {
                "lat": 37.770108, 
                "lng": -122.509460
            },
            "zoom": 16
        }
    },    
    {
        "title": "",
        "text": "Also in Golden Gate Park is the De Young Museum, rebuilt in 2005. The original was built, along with the music concourse and the Japanese Tea Garden at the same spot, as part of the 1893 California Midwinter International Exposition. The park's superintendent hated all three.",
        "location": {
            "place": "De Young Museum",
            "center": {
                "lat": 37.770883, 
                "lng": -122.46833
            },
            "zoom": 16
        }
    },    
    {
        "title": "",
        "text": "De Young was the owner of the San Francisco Chronicle, and also built the Chronicle Building, which in 1890 at 10(!) stories was San Francisco's first \"skyscraper\" and the tallest building on the West Coast.",
        "location": {
            "place": "Old Chronicle Building",
            "center": {
                "lat": 37.788130, 
                "lng": -122.403006
            },
            "zoom": 19
        }
    },    
    {
        "title": "",
        "text": "Judah Street, home of the N-Judah Muni line, is appropriately named after Theodora Dehone Judah, who built California's first railroad in 1856. He also built the transcontinental railroad linking the east and west coasts, but died before it was finished.",
        "location": {
            "place": "Judah Street",
            "center": {
                "lat": 37.761211, 
                "lng": -122.488051
            },
            "zoom": 17
        }
    },    
    {
        "title": "Yikes",
        "text": "That's it for now! I'll add more streets to the history later. I haven't even got to the wacky names of the streets in the Sunset.",
        "location": {
            "place": "The Outer Sunset",
            "center": {
                "lat": 37.752308, 
                "lng": -122.494074
            },
            "zoom": 13
        }
    },    
    {
        "title": "Sources",
        "text": "My primary source is A Short History of San Francisco by Tom Cole, which is both excellent and, indeed, very short. I recommend it. Another absolutely wonderful resource is this interactive map of SF streets with their names: <a href=\"http://sfstreets.noahveltman.com/\">sfstreets.noahveltman.com</a>.",
        "location": {
            "place": "San Francisco",
            "center": {
                "lat": 37.765550,
                "lng": -122.447558
            },
            "zoom": 5
        }
    }
]